[
    {
        "name": "Countries Individual Project",
        "description": "Fullstack web application that relates the countries of the world and the activities that can be done in them. It allows the users to create any activity and relate it to as many countries as they want. It also shows relevant information about all the countries of the world",
        "frontEnd": {
            "graphicConcept": "Early stages of aviation. Vintage style. Uses typographies from the first ",
            "graphicDesigner": "https://www.instagram.com/eli.creanding/",
            "responsive": "No",
            "wiews": [{
                    "name": "Landing Page",
                    "description": "Welcoming page that allows entrance to the application and provides links to my social media pages"
                },
                {
                    "name": "Home Page",
                    "description": "This page contains the main functionality of the app. It displays all the countries' cards organized in pages of 10 countries. It also has a panel that allows the information to be organized and filtered according to different parameters."
                },
                {
                    "name": "Detail Page",
                    "description": "Shows further information about the selected country."
                },
                {
                    "name": "Activities Page",
                    "description": "Displays all the activities that are stored in the data base, including the countries in which they are available. It includes a form that allows the user to create new activities"
                }
            ],
            "technologies": ["Node", "React", "Redux", "CSS"]
        },
        "backEnd": {
            "description":"CRUD API that filters and serves information for the frontEnd",
            "routes":[
                {
                    "route": "GET| /countries",
                    "description": "Recieves via query the filter and organization parameters from the client and obtains an array of objects where each object is a country with all of its information"
                },
                {
                    "route": "GET| /countries/:id",
                    "description": "Recieves the ID of a country and obtains the detailed information of the country that was requested"
                },
                {
                    "route": "POST| /activities",
                    "description": "Recieves all the information necessary to create a new activity and stores it in the database"
                }
            ]
        }
    }   
]